// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Обращаться к числу как к строке нельзя.

// // 456 -> 5
// // 782 -> 8
// // 918 -> 1

// Console.WriteLine("введите целое трехзначное число");
// int x = Convert.ToInt32(Console.ReadLine());


// if (x>99 && x<1000)
// {
//     x= x/10;
// }    
     
//     int resolt = x %10 ;
//     Console.Write($"{resolt} является второй цифрой от числа ");









// // Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. Обращаться к числу как к строке нельзя.
// // 645 -> 5
// // 78 -> третьей цифры нет


// Console.WriteLine("введите целое число");
// int N = Convert.ToInt32(Console.ReadLine());
// int n = N;

// if (N<100)
// {
//     Console.WriteLine("третьей цифры нет");
// }
// else 
// {
//      while (N>1000)
//      {
//         N=N / 10;
//      }
//     int resolt = N %10 ;
//     Console.Write($"{resolt} является третьей цифрой от числа {n}");
// }










// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("введите целое число от 1 до 7 ");
// int x = Convert.ToInt32(Console.ReadLine());

// if (x==1)  Console.WriteLine ("рабочий");
// else if (x==2)  Console.WriteLine ("рабочий");
// else if (x==3)  Console.WriteLine ("рабочий");
// else if (x==4)  Console.WriteLine ("рабочий");
// else if (x==5)  Console.WriteLine ("рабочий");
// else if (x==6)  Console.WriteLine ("выходной");
// else if (x==7)  Console.WriteLine ("выходной");
